# ebird Toekn
token       = "replace_with_your_ebird_token"

# info 
date        = "20250310"
startTime   = "7:30"
endTime     = "12:00"
volunters   = "杨虹、大鹏、乐行"
adult       = 16
juv         = 1
weather     = "晴，轻度污染 4-16度，湿度35%"

# datebase
checklist = {"月季园": "S217624766",
			 "温室西": "S217625101",
			 "芍药园-牡丹园-海棠园": "S217624938",
			 "梅园-栈道": "S217625354",
			 "水源头": "S217625490",
			 "碧桃园-丁香园": "S217813836",
			 "卧佛寺周边": "S217625639",
			 "绚秋苑": "S217813897",
			 "东南门+澄静湖": "S217815078",
			 "黄叶村+中湖": "S217814272",
			 "王锡彤墓+北湖": "S217814346",
			 "梁启超墓": "S217814572",
			 "树木园": "S217814997"
			}

howManyPeople = "成人（%d）学生（%d）"%(adult,juv)