from openpyxl.worksheet.datavalidation import DataValidation
# 水鸟
dvbe1 = DataValidation(type="list", formula1='"游弋,停歇,飞行,觅食,争斗,求偶,筑巢,育雏"', allow_blank=True)
dvli1 = DataValidation(type="list", formula1='"湖面,岸边,地面,树枝,空中,溪流"', allow_blank=True)

# 林鸟
dvbe2 = DataValidation(type="list", formula1='"飞落,停歇,飞行,觅食,争斗,筑巢,求偶,交配,捕食,育雏,鸣叫,鸣唱,喝水,洗澡"', allow_blank=True)
dvli2 = DataValidation(type="list", formula1='"树林,灌丛,地面,草坪,电线,空中,树干,芦苇,溪流,枝头,油松,河道"', allow_blank=True)

def addDV(be, li, ws1, ws2):
	be.add(ws1)
	li.add(ws2)

def applyDV(ws, dvx):
	ws.add_data_validation(dvx)

ListWater = ['绿头鸭','鸳鸯','小䴙䴘']

dBeLi = {'绿头鸭': ["游弋","湖面"],
		 '山斑鸠': ["停歇","树林"],
		 '珠颈斑鸠': ["停歇","树林"],
		 '普通鸬鹚': ["飞行","空中"],
		 '苍鹭': ["飞行","空中"],
		 '大斑啄木鸟': ["停歇","树干"],
		 '灰头绿啄木鸟': ["觅食","草坪"],
		 '灰喜鹊': ["飞行","空中"],
		 '喜鹊': ["飞落","树林"],
		 '秃鼻乌鸦': ["飞行","空中"],
		 '大嘴乌鸦': ["飞行","空中"],
		 '沼泽山雀': ["觅食","树林"],
		 '大山雀': ["停歇","灌丛"],
		 '白头鹎': ["鸣叫","枝头"],
		 '银喉长尾山雀': ["停歇","树林"],
		 '黑头䴓': ["觅食","油松"],
		 '灰椋鸟': ["停歇","枝头"],
		 '乌鸫': ["停歇","地面"],
		 '红尾斑鸫': ["停歇","枝头"],
		 '北红尾鸲': ["停歇","灌丛"],
		 '麻雀': ["觅食","灌丛"],
		 '燕雀': ["飞行","空中"],
		 '黑尾蜡嘴雀': ["觅食","草坪"],
		 '金翅雀': ["停歇","枝头"],
		 '鸳鸯': ["游弋","湖面"],
		 '小䴙䴘': ["游弋","湖面"],
		 '雀鹰': ["飞行","空中"],
		 '黄腹山雀': ["停歇","枝头"],
		 '领雀嘴鹎': ["停歇","枝头"],
		 '棕头鸦雀': ["觅食","芦苇"],
		 '鹪鹩': ["觅食","溪流"],
		 '赤颈鸫': ["停歇","枝头"],
		 '斑鸫': ["停歇","枝头"],
		 '红尾水鸲': ["停歇","溪流"],
		 '黄喉鹀': ["停歇","枝头"],
		 '黄眉鹀': ["停歇","枝头"],
		 '白眉鹀': ["停歇","枝头"],
		 '星头啄木鸟': ["停歇","树干"],
		 '红嘴蓝鹊': ["飞行","空中"]
		 }
